benchmark_results/vLLM_Qwen3_VL_32B_Instruct_FP8_20260129_022129.txt
##############################################################
# vLLM BENCHMARK RESULTS
##############################################################

SOURCE
------
Benchmark CLI Documentation:
https://docs.vllm.ai/en/stable/benchmarking/cli/#synthetic-random-images-random-mm

METADATA
--------
Date:            Thu Jan 29 02:21:29 AM UTC 2026
Hostname:        spark-ff62
Model:           Qwen/Qwen3-VL-32B-Instruct-FP8
Num Prompts:     100
Max Concurrency: 10
Num Warmups:     10
Input Length:    1000 (±0.3)
Output Length:   220 (±0.3)
Seed:            42
Image Bucket:    512x512 (20%), 720x1280 (30%), 1024x1024 (20%), 1080x1920 (30%)

SYSTEM INFO
-----------
NVIDIA GB10, [N/A], 580.95.05

##############################################################
# TEST RESULTS
##############################################################

============================================================
TEST: Text-Only (0 images)
Images per request: 0
Started: Thu Jan 29 02:21:29 AM UTC 2026
============================================================


==========
== vLLM ==
==========

NVIDIA Release 25.12.post1 (build 247811356)
vLLM Version 0.12.0+35a9f223
Container image Copyright (c) 2025, NVIDIA CORPORATION & AFFILIATES. All rights reserved.

Various files include modifications (c) NVIDIA CORPORATION & AFFILIATES.  All rights reserved.

GOVERNING TERMS: The software and materials are governed by the NVIDIA Software License Agreement
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/nvidia-software-license-agreement/)
and the Product-Specific Terms for NVIDIA AI Products
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/product-specific-terms-for-ai-products/).

WARNING: The NVIDIA Driver was not detected.  GPU functionality will not be available.
   Use the NVIDIA Container Toolkit to start this container with GPU support; see
   https://docs.nvidia.com/datacenter/cloud-native/ .

NOTE: The SHMEM allocation limit is set to the default of 64MB.  This may be
   insufficient for vLLM.  NVIDIA recommends the use of the following flags:
   docker run --gpus all --ipc=host --ulimit memlock=-1 --ulimit stack=67108864 ...

/usr/local/lib/python3.12/dist-packages/torchvision/io/image.py:14: UserWarning: Failed to load image Python extension: 'Could not load this library: /usr/local/lib/python3.12/dist-packages/torchvision/image.so'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
INFO 01-29 02:21:32 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 01-29 02:21:32 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 01-29 02:21:32 [interface.py:221] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 01-29 02:21:33 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf12b9655ce00>, seed=42, num_prompts=100, dataset_name='random-mm', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=220, random_range_ratio=0.3, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=0, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 1, 'video': 0}, random_mm_bucket_config={(512, 512, 1): 0.2, (720, 1280, 1): 0.3, (1024, 1024, 1): 0.2, (1080, 1920, 1): 0.3}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=10, model='Qwen/Qwen3-VL-32B-Instruct-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=10, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-336c07c1-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
tokenizer_config.json: 10.9kB [00:00, 45.1MB/s]
vocab.json: 4.96MB [00:00, 63.1MB/s]
tokenizer.json: 100% 10.2M/10.2M [00:00<00:00, 53.8MB/s]
INFO 01-29 02:21:36 [datasets.py:613] Sampling input_len from [700, 1300] and output_len from [154, 286]
INFO 01-29 02:21:36 [datasets.py:970] Normalized bucket config: {(512, 512, 1): 0.2, (720, 1280, 1): 0.3, (1024, 1024, 1): 0.2, (1080, 1920, 1): 0.3}
INFO 01-29 02:21:36 [datasets.py:982] Updated mm-limit-per-prompt: {'image': 1}
INFO 01-29 02:21:36 [datasets.py:1004] Sampling number of multimodal items from [0, 0]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
  0% 0.0009503329638391733/600 [00:46<8087:52:37, 48527.34s/s]
Initial test run completed.
Warming up with 10 requests...
100% 10/10 [00:42<00:00,  4.21s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 10
100% 100/100 [07:11<00:00,  4.31s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             10        
Benchmark duration (s):                  431.40    
Total input tokens:                      101603    
Total generated tokens:                  21883     
Request throughput (req/s):              0.23      
Output token throughput (tok/s):         50.73     
Peak output token throughput (tok/s):    70.00     
Peak concurrent requests:                14.00     
Total Token throughput (tok/s):          286.25    
---------------Time to First Token----------------
Mean TTFT (ms):                          1316.05   
Median TTFT (ms):                        1005.41   
P99 TTFT (ms):                           4978.62   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          183.32    
Median TPOT (ms):                        183.86    
P99 TPOT (ms):                           195.54    
---------------Inter-token Latency----------------
Mean ITL (ms):                           182.57    
Median ITL (ms):                         166.58    
P99 ITL (ms):                            639.73    
==================================================

Completed: Thu Jan 29 02:30:17 AM UTC 2026


============================================================
TEST: Single Image (1 image)
Images per request: 1
Started: Thu Jan 29 02:30:17 AM UTC 2026
============================================================


==========
== vLLM ==
==========

NVIDIA Release 25.12.post1 (build 247811356)
vLLM Version 0.12.0+35a9f223
Container image Copyright (c) 2025, NVIDIA CORPORATION & AFFILIATES. All rights reserved.

Various files include modifications (c) NVIDIA CORPORATION & AFFILIATES.  All rights reserved.

GOVERNING TERMS: The software and materials are governed by the NVIDIA Software License Agreement
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/nvidia-software-license-agreement/)
and the Product-Specific Terms for NVIDIA AI Products
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/product-specific-terms-for-ai-products/).

WARNING: The NVIDIA Driver was not detected.  GPU functionality will not be available.
   Use the NVIDIA Container Toolkit to start this container with GPU support; see
   https://docs.nvidia.com/datacenter/cloud-native/ .

NOTE: The SHMEM allocation limit is set to the default of 64MB.  This may be
   insufficient for vLLM.  NVIDIA recommends the use of the following flags:
   docker run --gpus all --ipc=host --ulimit memlock=-1 --ulimit stack=67108864 ...

/usr/local/lib/python3.12/dist-packages/torchvision/io/image.py:14: UserWarning: Failed to load image Python extension: 'Could not load this library: /usr/local/lib/python3.12/dist-packages/torchvision/image.so'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
INFO 01-29 02:30:19 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 01-29 02:30:19 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 01-29 02:30:19 [interface.py:221] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 01-29 02:30:20 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf8040a150e00>, seed=42, num_prompts=100, dataset_name='random-mm', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=220, random_range_ratio=0.3, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 1, 'video': 0}, random_mm_bucket_config={(512, 512, 1): 0.2, (720, 1280, 1): 0.3, (1024, 1024, 1): 0.2, (1080, 1920, 1): 0.3}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=10, model='Qwen/Qwen3-VL-32B-Instruct-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=10, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-1997723f-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
tokenizer_config.json: 10.9kB [00:00, 88.0MB/s]
vocab.json: 4.96MB [00:00, 63.3MB/s]
tokenizer.json: 100% 10.2M/10.2M [00:00<00:00, 47.5MB/s]
INFO 01-29 02:30:23 [datasets.py:613] Sampling input_len from [700, 1300] and output_len from [154, 286]
INFO 01-29 02:30:23 [datasets.py:970] Normalized bucket config: {(512, 512, 1): 0.2, (720, 1280, 1): 0.3, (1024, 1024, 1): 0.2, (1080, 1920, 1): 0.3}
INFO 01-29 02:30:23 [datasets.py:982] Updated mm-limit-per-prompt: {'image': 1}
INFO 01-29 02:30:23 [datasets.py:1004] Sampling number of multimodal items from [1, 1]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
  0% 0.0009286529384553432/600 [00:51<9327:33:19, 55965.42s/s]
Initial test run completed.
Warming up with 10 requests...
100% 10/10 [00:44<00:00,  4.42s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 10
100% 100/100 [08:34<00:00,  5.15s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             10        
Benchmark duration (s):                  514.58    
Total input tokens:                      101603    
Total generated tokens:                  21883     
Request throughput (req/s):              0.19      
Output token throughput (tok/s):         42.53     
Peak output token throughput (tok/s):    62.00     
Peak concurrent requests:                12.00     
Total Token throughput (tok/s):          239.97    
---------------Time to First Token----------------
Mean TTFT (ms):                          2087.50   
Median TTFT (ms):                        1702.58   
P99 TTFT (ms):                           7600.90   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          217.84    
Median TPOT (ms):                        220.35    
P99 TPOT (ms):                           243.42    
---------------Inter-token Latency----------------
Mean ITL (ms):                           216.88    
Median ITL (ms):                         181.02    
P99 ITL (ms):                            1241.41   
==================================================

Completed: Thu Jan 29 02:40:35 AM UTC 2026


##############################################################
# vLLM BENCHMARK COMPLETE
##############################################################

Source: https://docs.vllm.ai/en/stable/benchmarking/cli/#synthetic-random-images-random-mm
Results saved to: ./benchmark_results/vLLM_Qwen3_VL_32B_Instruct_FP8_20260129_022129.txt